; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v4 ?v2)
             (pred_7 ?v9 ?v1)
             (pred_1 ?v4 ?v1)
             (pred_9 ?v11 ?v4 )
	     (pred_3 ?v4)
             (pred_5 ?v6)
             (pred_10 ?v9)
             (pred_6 ?v1)
             (pred_8 ?v4)
             (pred_2 ?v9)
             (pred_4 ?v4)
             (pred_11 ))



(:action op_2
:parameters (?v8 ?v7 ?v5 ?v13)
:precondition (and (pred_5 ?v8) (pred_5 ?v7) (pred_10 ?v5) (pred_6 ?v13)
          (pred_12 ?v8 ?v7) (pred_7 ?v5 ?v13)
                   (pred_1 ?v7 ?v13) (pred_3 ?v8) 
                   (pred_8 ?v7) (pred_2 ?v5))
:effect (and  (pred_4 ?v7) (not (pred_8 ?v7))))


(:action op_3
:parameters (?v8 ?v3)
:precondition (and (pred_5 ?v8) (pred_5 ?v3)
               (pred_3 ?v8) (pred_12 ?v8 ?v3) (pred_4 ?v3))
:effect (and (pred_3 ?v3) (not (pred_3 ?v8))))

(:action op_4
:parameters (?v8 ?v5)
:precondition (and (pred_5 ?v8) (pred_10 ?v5) 
                  (pred_3 ?v8) (pred_9 ?v5 ?v8) (pred_11 ))
:effect (and (pred_2 ?v5)
   (not (pred_9 ?v5 ?v8)) (not (pred_11 ))))


(:action op_1
:parameters (?v8 ?v10 ?v12)
:precondition (and (pred_5 ?v8) (pred_10 ?v10) (pred_10 ?v12)
                  (pred_3 ?v8) (pred_2 ?v12) (pred_9 ?v10 ?v8))
:effect (and (pred_2 ?v10) (pred_9 ?v12 ?v8)
        (not (pred_2 ?v12)) (not (pred_9 ?v10 ?v8))))

(:action op_5
:parameters (?v8 ?v5)
:precondition (and (pred_5 ?v8) (pred_10 ?v5) 
                  (pred_3 ?v8) (pred_2 ?v5))
:effect (and (pred_11 ) (pred_9 ?v5 ?v8) (not (pred_2 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_07 obj_03 obj_04 obj_20 obj_02 obj_13 obj_17 obj_06 obj_05 obj_15 obj_12 obj_09 obj_19 obj_21 obj_01
    obj_08 obj_11 obj_18
    obj_22 obj_16 obj_14
    )

    (:init
       (pred_11)

       (pred_5 obj_10)
       (pred_5 obj_07)
       (pred_5 obj_03)
       (pred_5 obj_04)
       (pred_5 obj_20)
       (pred_5 obj_02)
       (pred_5 obj_13)
       (pred_5 obj_17)
       (pred_5 obj_06)
       (pred_5 obj_05)
       (pred_5 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_09)
       (pred_5 obj_19)
       (pred_5 obj_21)
       (pred_5 obj_01)
       (pred_6 obj_08)
       (pred_6 obj_11)
       (pred_6 obj_18)
       (pred_10 obj_22)
       (pred_10 obj_16)
       (pred_10 obj_14)

       (pred_12 obj_10 obj_20)
       (pred_12 obj_10 obj_07)
       (pred_12 obj_07 obj_02)
       (pred_12 obj_07 obj_03)
       (pred_12 obj_07 obj_10)
       (pred_12 obj_03 obj_13)
       (pred_12 obj_03 obj_04)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_04 obj_17)
       (pred_12 obj_04 obj_03)
       (pred_12 obj_20 obj_06)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_20 obj_10)
       (pred_12 obj_02 obj_05)
       (pred_12 obj_02 obj_13)
       (pred_12 obj_02 obj_07)
       (pred_12 obj_02 obj_20)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_17)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_13 obj_02)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_17 obj_04)
       (pred_12 obj_17 obj_13)
       (pred_12 obj_06 obj_09)
       (pred_12 obj_06 obj_05)
       (pred_12 obj_06 obj_20)
       (pred_12 obj_05 obj_19)
       (pred_12 obj_05 obj_15)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_05 obj_06)
       (pred_12 obj_15 obj_21)
       (pred_12 obj_15 obj_12)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_15 obj_05)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_12 obj_15)
       (pred_12 obj_09 obj_19)
       (pred_12 obj_09 obj_06)
       (pred_12 obj_19 obj_21)
       (pred_12 obj_19 obj_05)
       (pred_12 obj_19 obj_09)
       (pred_12 obj_21 obj_01)
       (pred_12 obj_21 obj_15)
       (pred_12 obj_21 obj_19)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_01 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_19)
       (pred_8 obj_12)
       (pred_1  obj_09 obj_08)
       (pred_1  obj_19 obj_11)
       (pred_1  obj_12 obj_18)
       (pred_4 obj_10)
       (pred_4 obj_07)
       (pred_4 obj_03)
       (pred_4 obj_04)
       (pred_4 obj_20)
       (pred_4 obj_02)
       (pred_4 obj_13)
       (pred_4 obj_17)
       (pred_4 obj_06)
       (pred_4 obj_05)
       (pred_4 obj_15)
       (pred_4 obj_21)
       (pred_4 obj_01)

       (pred_7  obj_22 obj_08)
       (pred_7  obj_16 obj_11)
       (pred_7  obj_14 obj_18)
       (pred_9 obj_22 obj_17)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_14 obj_03)
       (pred_3 obj_05)
    )

    (:goal (and
       (pred_9 obj_14 obj_06)
    ))
(:constraints
  (always (not (pred_3 obj_07)))
)
)

; plan
1. (op_3 obj_05 obj_02)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_02)
   goals met: 0 of 1
2. (op_3 obj_02 obj_13)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_13)
   goals met: 0 of 1
3. (op_3 obj_13 obj_03)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_03)
   goals met: 0 of 1
4. (op_4 obj_03 obj_14)
   deleted: (pred_9 obj_14 obj_03) (pred_11)
   added: (pred_2 obj_14)
   goals met: 0 of 1
5. (op_3 obj_03 obj_13)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_13)
   goals met: 0 of 1
6. (op_3 obj_13 obj_02)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_02)
   goals met: 0 of 1
7. (op_3 obj_02 obj_20)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_20)
   goals met: 0 of 1
8. (op_3 obj_20 obj_06)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_06)
   goals met: 0 of 1
9. (op_5 obj_06 obj_14)
   deleted: (pred_2 obj_14)
   added: (pred_11) (pred_9 obj_14 obj_06)
   goals met: 1 of 1
